if OS.mac?
  tap "homebrew/cask-fonts"
  tap "koekeishiya/formulae"

  # Work software
  tap "heroku/brew"
  brew "heroku"
  brew "firebase-cli"

  brew "trash"

  # Tiling WM - Yabai
  brew "yabai"
  brew "skhd"

  # Mac specific applications
  cask "scroll-reverser"

  cask "font-jetbrains-mono"
  cask "font-symbols-only-nerd-font"
  cask "bitwarden"
  brew "coreutils"
end

tap "homebrew/bundle"

# Tools
brew "ripgrep"
brew "fzf"
brew "fd"
brew "git"
brew "git-filter-repo"
brew "tree"
brew "bat"
brew "htop"
brew "jq"
brew "yq"
brew "neofetch"
brew "lazygit"
brew "eza"
brew "zoxide"
cask "nextcloud"
brew "watch"
brew "ast-grep"
brew "cloc"

# Languages and lang specific tooling
brew "fnm"
brew "python"
brew "prettierd"
brew "stylua"

# Misc software
brew "nmap"
brew "mpv"
brew "pipes-sh"
brew "cava"
brew "gnupg"
cask "docker"

# Terminal config
cask "wezterm"
brew "fish"
brew "utf8proc", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
brew "tmux"
brew "smug"
brew "tpm"
